Revit 2018 API
VerticalTextAlignment Enumeration
 Supported kinds of text vertical alignment within the text containing box.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum VerticalTextAlignment
Visual Basic
Public Enumeration VerticalTextAlignment
Visual C++
public enum class VerticalTextAlignment
Members
Member name | Description
Top |  Text is aligned with the top side of the text box.
Bottom |  Text is aligned with the bottom side of the text box.
Middle |  Text is vertically centered within the text box.
See Also
Autodesk.Revit.DB Namespace